# Volume Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassZone..::..Volume Property
MassZone Class See Also
---
The volume of the MassZone.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Volume { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Volume As Double
	Get
```

Visual C++
---
```text
public:
property double Volume {
	double get ();
}
```

# See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace